In [ ]:
import pandas as pd # import pandas library

In [ ]:
df=pd.read_csv("student_dataset.csv") # load csv file

In [ ]:
df.head() # First 5 rows

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [ ]:
df.tail() # Last 5 rows

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [ ]:
df.shape # (rows,columns)

(1000, 5)

In [ ]:
df.info() # summary (data types, non-null count)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [ ]:
df.describe() # summary statistics (mean, std, min, max, etc.)

                ID        Age        Marks
count  1000.000000  1000.0000  1000.000000
mean    500.500000    20.9600    70.232000
std     288.819436     2.0036    17.468638
min       1.000000    18.0000    40.000000
25%     250.750000    19.0000    56.000000
50%     500.500000    21.0000    70.000000
75%     750.250000    23.0000    86.000000
max    1000.000000    24.0000   100.000000

In [ ]:
df.columns # list of column names

Index(['ID', 'Name', 'Age', 'Marks', 'Gender'], dtype='object')

In [ ]:
df.dtypes # data types of each column

ID         int64
Name      object
Age        int64
Marks      int64
Gender    object
dtype: object

In [ ]:
df.index # row index

RangeIndex(start=0, stop=1000, step=1)

In [ ]:
df.to_csv("Student_Dataset Output File",index=False) # Saving Output File

In [ ]:
df['Marks'].mean() # average marks

np.float64(70.232)

In [ ]:
df['Marks'].median() # median

np.float64(70.0)

In [ ]:
df['Marks'].max() # maximum value

np.int64(100)

In [ ]:
df['Marks'].min() # minimum value

np.int64(40)

In [ ]:
df['Marks'].sum() # sum of column

np.int64(70232)

In [ ]:
df['Marks'].value_counts # frequency count

<bound method IndexOpsMixin.value_counts of 0      94
1      81
2      90
3      56
4      44
       ..
995    82
996    73
997    96
998    65
999    80
Name: Marks, Length: 1000, dtype: int64>